src/Reports/ОтчетПоНормированиюКанбановУТП/ОтчетПоНормированиюКанбановУТП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормированиюКанбановУТП</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/БригаднаяСделка/БригаднаяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БригаднаяСделка</name>
  <posting>Deny</posting>
  <attributes>
    <name>БезУчётаВыходныхДней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедомостьВыходногоДня</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочихЧасовВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоНаряду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Подработка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочихЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазрядоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоНаряду</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаВВыходной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДВТФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПВТФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчетПоНормированиюКанбановУТП/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
СписокТО = Новый СписокЗначений;
ТаблицаТО = Новый ТаблицаЗначений;
ТаблицаТОИзделия = Новый ТаблицаЗначений;

ТаблицаТО.Колонки.Добавить("ТО",Новый ОписаниеТипов("СправочникСсылка.ТехОперации"));
ТаблицаТО.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаТО.Колонки.Добавить("Расценка",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТО.Колонки.Добавить("РасценкаНаПартию",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТО.Колонки.Добавить("СуммаТО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));

ТаблицаТОИзделия.Колонки.Добавить("ТО",Новый ОписаниеТипов("СправочникСсылка.ТехОперации"));
ТаблицаТОИзделия.Колонки.Добавить("Расценка",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТОИзделия.Колонки.Добавить("РасценкаНаПартию",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТОИзделия.Колонки.Добавить("СуммаТО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));

ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",СписокЛинеек[0].Значение.Подразделение);
ВыборкаТО = Справочники.ТехОперации.ВыбратьИерархически(ГруппаТехОпераций);
	Пока ВыборкаТО.Следующий() Цикл
		Если ВыборкаТО.ЭтоГруппа Тогда
		Продолжить;	
		КонецЕсли;
	СписокТО.Добавить(ВыборкаТО.Ссылка,ВыборкаТО.Ссылка.Код);
		Для каждого Линейка Из СписокЛинеек Цикл
			Если Линейка.Значение.ЭтоГруппа Тогда
			ВыборкаЛинейки = Справочники.Линейки.ВыбратьИерархически(Линейка.Значение);
				Пока ВыборкаЛинейки.Следующий() Цикл					
					Если Не ВыборкаЛинейки.Ссылка.ЭтоГруппа Тогда
					ТЧ = ТаблицаТО.Добавить();
					ТЧ.ТО = ВыборкаТО.Ссылка;
					ТЧ.Линейка = ВыборкаЛинейки.Ссылка;
					КонецЕсли;			
				КонецЦикла; 
			Иначе	
			ТЧ = ТаблицаТО.Добавить();
			ТЧ.ТО = ВыборкаТО.Ссылка;
			ТЧ.Линейка = Линейка.Значение;			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
СписокТО.СортироватьПоПредставлению();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаТехОперация = Макет.ПолучитьОбласть("Шапка|ТехОперация");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблЛинейкаОбщая = Макет.ПолучитьОбласть("Линейка|Общая");
ОблЛинейкаТехОперация = Макет.ПолучитьОбласть("Линейка|ТехОперация");
ОблЛинейкаИтого = Макет.ПолучитьОбласть("Линейка|Итого");
ОблЛинейкаИтогоОбщая = Макет.ПолучитьОбласть("ЛинейкаИтого|Общая");
ОблЛинейкаИтогоТехОперация = Макет.ПолучитьОбласть("ЛинейкаИтого|ТехОперация");
ОблЛинейкаИтогоИтого = Макет.ПолучитьОбласть("ЛинейкаИтого|Итого");
ОблИзделиеОбщая = Макет.ПолучитьОбласть("Изделие|Общая");
ОблИзделиеТехОперация = Макет.ПолучитьОбласть("Изделие|ТехОперация");
ОблИзделиеИтого = Макет.ПолучитьОбласть("Изделие|Итого");
ОблИзделиеИтогоОбщая = Макет.ПолучитьОбласть("ИзделиеИтого|Общая");
ОблИзделиеИтогоТехОперация = Макет.ПолучитьОбласть("ИзделиеИтого|ТехОперация");
ОблИзделиеИтогоИтого = Макет.ПолучитьОбласть("ИзделиеИтого|Итого");
ОблМТКОбщая = Макет.ПолучитьОбласть("МТК|Общая");
ОблМТКТехОперация = Макет.ПолучитьОбласть("МТК|ТехОперация");
ОблМТКИтого = Макет.ПолучитьОбласть("МТК|Итого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецТехОперация = Макет.ПолучитьОбласть("Конец|ТехОперация");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"");
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого ТО Из СписокТО Цикл	
	ОблШапкаТехОперация.Параметры.ТО = ТО.Значение;
	ТабДок.Присоединить(ОблШапкаТехОперация);				
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.ДокументОснование.Линейка КАК Линейка,
	|	ВыпускПродукцииКанбан.Изделие КАК Изделие,
	|	ВыпускПродукцииКанбан.Количество КАК Количество,
	|	ВыпускПродукцииКанбан.ДокументОснование.Линейка.Наименование КАК ДокументОснованиеЛинейкаНаименование,
	|	ВыпускПродукцииКанбан.Изделие.Наименование КАК ИзделиеНаименование,
	|	ВыпускПродукцииКанбан.ДокументОснование.ДокументОснование КАК МТК
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииКанбан.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
	Если СписокГруппНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ВыпускПродукцииКанбан.Изделие В ИЕРАРХИИ(&СписокГруппНоменклатуры)";
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
	КонецЕсли; 
		Если БезУчётаВыходныхДней Тогда	
		Запрос.Текст = Запрос.Текст + " И НЕ НАЧАЛОПЕРИОДА(ВыпускПродукцииКанбан.Дата, ДЕНЬ) В (&СписокВыходныхДней)";
	    Запрос.УстановитьПараметр("СписокВыходныхДней", СписокВыходныхДней);
		КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ДокументОснованиеЛинейкаНаименование,ИзделиеНаименование
								|ИТОГИ
								|	СУММА(Количество)
								|ПО
								|	Линейка,Изделие"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КоличествоВсего = 0;
СуммаЛинейкаВсего = 0;
	Пока ВыборкаЛинейки.Следующий() Цикл
	КоличествоЛинейкаИтого = 0;
	СуммаЛинейкаИтого = 0;
	ОблЛинейкаОбщая.Параметры.Линейка = ВыборкаЛинейки.Линейка;
	ТабДок.Вывести(ОблЛинейкаОбщая);
		Для каждого ТО Из СписокТО Цикл
		ТабДок.Присоединить(ОблЛинейкаТехОперация);				
		КонецЦикла;
	ТабДок.Присоединить(ОблЛинейкаИтого);
	ТабДок.НачатьГруппуСтрок("Линейка", Истина);
	ВыборкаИзделия = ВыборкаЛинейки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделия.Следующий() Цикл
		ТаблицаТОИзделия.Очистить();
		КоличествоИзделий = 0;
		СуммаИзделиеИтого = 0;
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделия.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделия.Изделие;
		ТабДок.Вывести(ОблИзделиеОбщая);
			Для каждого ТО Из СписокТО Цикл
			ТабДок.Присоединить(ОблИзделиеТехОперация);				
			КонецЦикла;
		ТабДок.Присоединить(ОблИзделиеИтого);
		ТабДок.НачатьГруппуСтрок("Изделие", Истина);
		ВыборкаДетальныхЗаписей = ВыборкаИзделия.Выбрать();
			Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
			СуммаМТКИтого = 0;
			Количество = ВыборкаДетальныхЗаписей.МТК.Количество;
			ОблМТКОбщая.Параметры.НомерМТК = ВыборкаДетальныхЗаписей.МТК.Номер;
			ОблМТКОбщая.Параметры.МТК = ВыборкаДетальныхЗаписей.МТК;
			ОблМТКОбщая.Параметры.КоличествоИзделий = Количество;
			ТабДок.Вывести(ОблМТКОбщая);
			КоличествоЛинейкаИтого = КоличествоЛинейкаИтого + Количество;
			КоличествоВсего = КоличествоВсего + Количество;
				Для каждого ТО Из СписокТО Цикл
				НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ВыборкаИзделия.Изделие,ТО.Значение));
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
				Расценка = Окр(НормыВремени.НормаВремени/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20);
				РасценкаНаПартию = НормыВремени.НормаВремениНаПартию/60*НормыТО.Стоимость;
				ОблМТКТехОперация.Параметры.НВ = НормыВремени.НормаВремени;
				ОблМТКТехОперация.Параметры.НВНаПартию = НормыВремени.НормаВремениНаПартию;
				ОблМТКТехОперация.Параметры.Расценка = Расценка;
				ОблМТКТехОперация.Параметры.РасценкаНаПартию = РасценкаНаПартию;
				Сумма = РасценкаНаПартию + Расценка*Количество;
				ОблМТКТехОперация.Параметры.Сумма = Сумма;
				ТабДок.Присоединить(ОблМТКТехОперация);
				СуммаМТКИтого = СуммаМТКИтого + Сумма;
				Выборка = ТаблицаТО.НайтиСтроки(Новый Структура("ТО,Линейка",ТО.Значение,ВыборкаЛинейки.Линейка));
				Выборка[0].Расценка = Выборка[0].Расценка + Расценка*Количество;
				Выборка[0].РасценкаНаПартию = Выборка[0].РасценкаНаПартию + РасценкаНаПартию;
				Выборка[0].СуммаТО = Выборка[0].СуммаТО + Сумма;
				ТЧ = ТаблицаТОИзделия.Добавить();
				ТЧ.ТО = ТО.Значение;
				ТЧ.Расценка = Расценка*Количество;
				ТЧ.РасценкаНаПартию = РасценкаНаПартию;
				ТЧ.СуммаТО = Сумма;				
				КонецЦикла;
			ОблМТКИтого.Параметры.СуммаИтого = СуммаМТКИтого;
			ТабДок.Присоединить(ОблМТКИтого);
			КоличествоИзделий = КоличествоИзделий + Количество;
			СуммаИзделиеИтого = СуммаИзделиеИтого + СуммаМТКИтого;
			СуммаЛинейкаИтого = СуммаЛинейкаИтого + СуммаМТКИтого;
			КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
		ТаблицаТОИзделия.Свернуть("ТО","Расценка,РасценкаНаПартию,СуммаТО");
		ОблИзделиеИтогоОбщая.Параметры.КоличествоИзделий = КоличествоИзделий;
		ТабДок.Вывести(ОблИзделиеИтогоОбщая);
			Для каждого ТО Из СписокТО Цикл
			НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ВыборкаИзделия.Изделие,ТО.Значение));
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
			Выборка = ТаблицаТОИзделия.НайтиСтроки(Новый Структура("ТО",ТО.Значение));
			ОблИзделиеИтогоТехОперация.Параметры.НВ = НормыВремени.НормаВремени;
			ОблИзделиеИтогоТехОперация.Параметры.НВНаПартию = НормыВремени.НормаВремениНаПартию;
			ОблИзделиеИтогоТехОперация.Параметры.Расценка = Выборка[0].Расценка;
			ОблИзделиеИтогоТехОперация.Параметры.РасценкаНаПартию = Выборка[0].РасценкаНаПартию;
			ОблИзделиеИтогоТехОперация.Параметры.Сумма = Выборка[0].СуммаТО;
			ТабДок.Присоединить(ОблИзделиеИтогоТехОперация);				
			КонецЦикла;
		ОблИзделиеИтогоИтого.Параметры.СуммаИтого = СуммаИзделиеИтого;
		ТабДок.Присоединить(ОблИзделиеИтогоИтого);		
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	ОблЛинейкаИтогоОбщая.Параметры.Линейка = ВыборкаЛинейки.Линейка;
	ОблЛинейкаИтогоОбщая.Параметры.КоличествоИзделий = КоличествоЛинейкаИтого;
	ТабДок.Вывести(ОблЛинейкаИтогоОбщая);
		Для каждого ТО Из СписокТО Цикл
		Выборка = ТаблицаТО.НайтиСтроки(Новый Структура("ТО,Линейка",ТО.Значение,ВыборкаЛинейки.Линейка));
		ОблЛинейкаИтогоТехОперация.Параметры.Расценка = Выборка[0].Расценка;
		ОблЛинейкаИтогоТехОперация.Параметры.РасценкаНаПартию = Выборка[0].РасценкаНаПартию;
		ОблЛинейкаИтогоТехОперация.Параметры.Сумма = Выборка[0].СуммаТО;
		ТабДок.Присоединить(ОблЛинейкаИтогоТехОперация);				
		КонецЦикла;
	ОблЛинейкаИтогоИтого.Параметры.СуммаИтого = СуммаЛинейкаИтого;
	ТабДок.Присоединить(ОблЛинейкаИтогоИтого);
	СуммаЛинейкаВсего = СуммаЛинейкаВсего + СуммаЛинейкаИтого;
	КонецЦикла;
ТаблицаТО.Свернуть("ТО","Расценка,РасценкаНаПартию,СуммаТО");
ОблКонецОбщая.Параметры.КоличествоИзделий = КоличествоВсего;
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого ТО Из СписокТО Цикл
	Выборка = ТаблицаТО.Найти(ТО.Значение,"ТО");
	ОблКонецТехОперация.Параметры.Расценка = Выборка.Расценка;
	ОблКонецТехОперация.Параметры.РасценкаНаПартию = Выборка.РасценкаНаПартию;
	ОблКонецТехОперация.Параметры.Сумма = Выборка.СуммаТО;
	ТабДок.Присоединить(ОблКонецТехОперация);				
	КонецЦикла;
ОблКонецИтого.Параметры.СуммаИтого = СуммаЛинейкаВсего;
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 2;
КонецПроцедуры

&НаСервере
Процедура СформироватьПоДокументуНаСервере()
СписокТО = Новый СписокЗначений;
ТаблицаТО = Новый ТаблицаЗначений;
ТаблицаТОИзделия = Новый ТаблицаЗначений;

ТаблицаТО.Колонки.Добавить("ТО",Новый ОписаниеТипов("СправочникСсылка.ТехОперации"));
ТаблицаТО.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаТО.Колонки.Добавить("Расценка",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТО.Колонки.Добавить("РасценкаНаПартию",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТО.Колонки.Добавить("СуммаТО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));

ТаблицаТОИзделия.Колонки.Добавить("ТО",Новый ОписаниеТипов("СправочникСсылка.ТехОперации"));
ТаблицаТОИзделия.Колонки.Добавить("Расценка",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТОИзделия.Колонки.Добавить("РасценкаНаПартию",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));
ТаблицаТОИзделия.Колонки.Добавить("СуммаТО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5)));

ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",СписокЛинеек[0].Значение.Подразделение);
ВыборкаТО = Справочники.ТехОперации.ВыбратьИерархически(ГруппаТехОпераций);
	Пока ВыборкаТО.Следующий() Цикл
		Если ВыборкаТО.ЭтоГруппа Тогда
		Продолжить;	
		КонецЕсли;
	СписокТО.Добавить(ВыборкаТО.Ссылка,ВыборкаТО.Ссылка.Код);
		Для каждого Линейка Из СписокЛинеек Цикл
			Если Линейка.Значение.ЭтоГруппа Тогда
			ВыборкаЛинейки = Справочники.Линейки.ВыбратьИерархически(Линейка.Значение);
				Пока ВыборкаЛинейки.Следующий() Цикл					
					Если Не ВыборкаЛинейки.Ссылка.ЭтоГруппа Тогда
					ТЧ = ТаблицаТО.Добавить();
					ТЧ.ТО = ВыборкаТО.Ссылка;
					ТЧ.Линейка = ВыборкаЛинейки.Ссылка;
					КонецЕсли;			
				КонецЦикла; 
			Иначе	
			ТЧ = ТаблицаТО.Добавить();
			ТЧ.ТО = ВыборкаТО.Ссылка;
			ТЧ.Линейка = Линейка.Значение;			
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
СписокТО.СортироватьПоПредставлению();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("МакетДляДокумента");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаТехОперация = Макет.ПолучитьОбласть("Шапка|ТехОперация");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблЛинейкаОбщая = Макет.ПолучитьОбласть("Линейка|Общая");
ОблЛинейкаТехОперация = Макет.ПолучитьОбласть("Линейка|ТехОперация");
ОблЛинейкаИтого = Макет.ПолучитьОбласть("Линейка|Итого");
ОблЛинейкаИтогоОбщая = Макет.ПолучитьОбласть("ЛинейкаИтого|Общая");
ОблЛинейкаИтогоТехОперация = Макет.ПолучитьОбласть("ЛинейкаИтого|ТехОперация");
ОблЛинейкаИтогоИтого = Макет.ПолучитьОбласть("ЛинейкаИтого|Итого");
ОблИзделиеОбщая = Макет.ПолучитьОбласть("Изделие|Общая");
ОблИзделиеТехОперация = Макет.ПолучитьОбласть("Изделие|ТехОперация");
ОблИзделиеИтого = Макет.ПолучитьОбласть("Изделие|Итого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецТехОперация = Макет.ПолучитьОбласть("Конец|ТехОперация");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"");
ОблШапкаОбщая.Параметры.ВидДокумента = ТипЗнч(ЭтаФорма.Параметры.Документ);
ОблШапкаОбщая.Параметры.Подразделение = ЭтаФорма.Параметры.Документ.Подразделение;
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого ТО Из СписокТО Цикл	
	ОблШапкаТехОперация.Параметры.ТО = ТО.Значение;
	ТабДок.Присоединить(ОблШапкаТехОперация);				
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.ДокументОснование.Линейка КАК Линейка,
	|	ВыпускПродукцииКанбан.Изделие КАК Изделие,
	|	ВыпускПродукцииКанбан.Количество КАК Количество,
	|	ВыпускПродукцииКанбан.ДокументОснование.Линейка.Наименование КАК ДокументОснованиеЛинейкаНаименование,
	|	ВыпускПродукцииКанбан.Изделие.Наименование КАК ИзделиеНаименование,
	|	ВыпускПродукцииКанбан.ДокументОснование.ДокументОснование КАК МТК
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииКанбан.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
	Если СписокГруппНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ВыпускПродукцииКанбан.Изделие В ИЕРАРХИИ(&СписокГруппНоменклатуры)";
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
	КонецЕсли; 
		Если БезУчётаВыходныхДней Тогда	
		Запрос.Текст = Запрос.Текст + " И НЕ НАЧАЛОПЕРИОДА(ВыпускПродукцииКанбан.Дата, ДЕНЬ) В (&СписокВыходныхДней)";
	    Запрос.УстановитьПараметр("СписокВыходныхДней", СписокВыходныхДней);
		КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО ДокументОснованиеЛинейкаНаименование,ИзделиеНаименование
								|ИТОГИ
								|	СУММА(Количество)
								|ПО
								|	Линейка,Изделие"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КоличествоВсего = 0;
СуммаЛинейкаВсего = 0;
	Пока ВыборкаЛинейки.Следующий() Цикл
	КоличествоЛинейкаИтого = 0;
	СуммаЛинейкаИтого = 0;
	ОблЛинейкаОбщая.Параметры.Линейка = ВыборкаЛинейки.Линейка;
	ТабДок.Вывести(ОблЛинейкаОбщая);
		Для каждого ТО Из СписокТО Цикл
		ТабДок.Присоединить(ОблЛинейкаТехОперация);				
		КонецЦикла;
	ТабДок.Присоединить(ОблЛинейкаИтого);
	ТабДок.НачатьГруппуСтрок("Линейка", Истина);
	ВыборкаИзделия = ВыборкаЛинейки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделия.Следующий() Цикл
		ТаблицаТОИзделия.Очистить();
		КоличествоИзделий = 0;
		СуммаИзделиеИтого = 0;
		ВыборкаДетальныхЗаписей = ВыборкаИзделия.Выбрать();
			Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
			СуммаМТКИтого = 0;
			Количество = ВыборкаДетальныхЗаписей.МТК.Количество;
			КоличествоЛинейкаИтого = КоличествоЛинейкаИтого + Количество;
			КоличествоВсего = КоличествоВсего + Количество;
				Для каждого ТО Из СписокТО Цикл
				НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ВыборкаИзделия.Изделие,ТО.Значение));
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
				Расценка = Окр(НормыВремени.НормаВремени/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20);
				РасценкаНаПартию = Окр(НормыВремени.НормаВремениНаПартию/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20);
				Сумма = РасценкаНаПартию + Расценка*Количество;
				СуммаМТКИтого = СуммаМТКИтого + Сумма;
				Выборка = ТаблицаТО.НайтиСтроки(Новый Структура("ТО,Линейка",ТО.Значение,ВыборкаЛинейки.Линейка));
				Выборка[0].Расценка = Выборка[0].Расценка + Расценка*Количество;
				Выборка[0].РасценкаНаПартию = Выборка[0].РасценкаНаПартию + РасценкаНаПартию;
				Выборка[0].СуммаТО = Выборка[0].СуммаТО + Сумма;
				ТЧ = ТаблицаТОИзделия.Добавить();
				ТЧ.ТО = ТО.Значение;
				ТЧ.Расценка = Расценка*Количество;
				ТЧ.РасценкаНаПартию = РасценкаНаПартию;
				ТЧ.СуммаТО = Сумма;				
				КонецЦикла;
			КоличествоИзделий = КоличествоИзделий + Количество;
			СуммаИзделиеИтого = СуммаИзделиеИтого + СуммаМТКИтого;
			СуммаЛинейкаИтого = СуммаЛинейкаИтого + СуммаМТКИтого;
			КонецЦикла;
		ТаблицаТОИзделия.Свернуть("ТО","Расценка,РасценкаНаПартию,СуммаТО");
		ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ВыборкаИзделия.Изделие.Наименование);
		ОблИзделиеОбщая.Параметры.Изделие = ВыборкаИзделия.Изделие;
		ОблИзделиеОбщая.Параметры.КоличествоИзделий = КоличествоИзделий;
		ТабДок.Вывести(ОблИзделиеОбщая);
			Для каждого ТО Из СписокТО Цикл
			НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ВыборкаИзделия.Изделие,ТО.Значение));
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
			Выборка = ТаблицаТОИзделия.НайтиСтроки(Новый Структура("ТО",ТО.Значение));
			ОблИзделиеТехОперация.Параметры.НВ = НормыВремени.НормаВремени;
			ОблИзделиеТехОперация.Параметры.НВНаПартию = НормыВремени.НормаВремениНаПартию;
			ОблИзделиеТехОперация.Параметры.Расценка = Выборка[0].Расценка;
			ОблИзделиеТехОперация.Параметры.РасценкаНаПартию = Выборка[0].РасценкаНаПартию;
			ОблИзделиеТехОперация.Параметры.Сумма = Выборка[0].СуммаТО;
			ТабДок.Присоединить(ОблИзделиеТехОперация);				
			КонецЦикла;
		ОблИзделиеИтого.Параметры.СуммаИтого = СуммаИзделиеИтого;
		ТабДок.Присоединить(ОблИзделиеИтого);		
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	ОблЛинейкаИтогоОбщая.Параметры.Линейка = ВыборкаЛинейки.Линейка;
	ОблЛинейкаИтогоОбщая.Параметры.КоличествоИзделий = КоличествоЛинейкаИтого;
	ТабДок.Вывести(ОблЛинейкаИтогоОбщая);
		Для каждого ТО Из СписокТО Цикл
		Выборка = ТаблицаТО.НайтиСтроки(Новый Структура("ТО,Линейка",ТО.Значение,ВыборкаЛинейки.Линейка));
		ОблЛинейкаИтогоТехОперация.Параметры.Расценка = Выборка[0].Расценка;
		ОблЛинейкаИтогоТехОперация.Параметры.РасценкаНаПартию = Выборка[0].РасценкаНаПартию;
		ОблЛинейкаИтогоТехОперация.Параметры.Сумма = Выборка[0].СуммаТО;
		ТабДок.Присоединить(ОблЛинейкаИтогоТехОперация);				
		КонецЦикла;
	ОблЛинейкаИтогоИтого.Параметры.СуммаИтого = СуммаЛинейкаИтого;
	ТабДок.Присоединить(ОблЛинейкаИтогоИтого);
	СуммаЛинейкаВсего = СуммаЛинейкаВсего + СуммаЛинейкаИтого;
	КонецЦикла;
ТаблицаТО.Свернуть("ТО","Расценка,РасценкаНаПартию,СуммаТО");
ОблКонецОбщая.Параметры.Мастер = ЭтаФорма.Параметры.Документ.Автор;
ОблКонецОбщая.Параметры.ЗаместительНачальникаПоУправлениюРесурсами = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Заместитель начальника по управлению ресурсами");
ОблКонецОбщая.Параметры.НачальникПЭО = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник ПЭО");
ОблКонецОбщая.Параметры.КоличествоИзделий = КоличествоВсего;
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого ТО Из СписокТО Цикл
	Выборка = ТаблицаТО.Найти(ТО.Значение,"ТО");
	ОблКонецТехОперация.Параметры.Расценка = Выборка.Расценка;
	ОблКонецТехОперация.Параметры.РасценкаНаПартию = Выборка.РасценкаНаПартию;
	ОблКонецТехОперация.Параметры.Сумма = Выборка.СуммаТО;
	ТабДок.Присоединить(ОблКонецТехОперация);				
	КонецЦикла;
ОблКонецИтого.Параметры.СуммаИтого = СуммаЛинейкаВсего;
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокЛинеек) Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
			СформироватьПоДокументуНаСервере();
		    Иначе
			СформироватьНаСервере();
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДокумента(Документ)
Парам = Новый Структура("Линейка,Дата,ВедомостьВыходногоДня,БезУчётаВыходныхДней",Документ.Линейка,Документ.Дата,Документ.ВедомостьВыходногоДня,Документ.БезУчётаВыходныхДней);
Возврат(Парам);
КонецФункции

&НаСервере
Функция ПолучитьСписокВыходныхДней(Документ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	БригаднаяСделка.Дата
	|ИЗ
	|	Документ.БригаднаяСделка КАК БригаднаяСделка
	|ГДЕ
	|	БригаднаяСделка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И БригаднаяСделка.Подразделение = &Подразделение
	|	И БригаднаяСделка.ВедомостьВыходногоДня = ИСТИНА
	|	И БригаднаяСделка.Комментарий ПОДОБНО &Комментарий";
Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Документ.Дата));
Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Документ.Дата));
Запрос.УстановитьПараметр("Подразделение", Документ.Подразделение);
Запрос.УстановитьПараметр("Комментарий", Документ.Комментарий);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокВыходныхДней.Добавить(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ПараметрыДокумента = ПолучитьПараметрыДокумента(ЭтаФорма.Параметры.Документ);	
	СписокЛинеек.Очистить();
	СписокЛинеек.Добавить(ПараметрыДокумента.Линейка);
		Если ПараметрыДокумента.ВедомостьВыходногоДня Тогда        
		Отчет.Период.ДатаНачала = ПараметрыДокумента.Дата;			
		Отчет.Период.ДатаОкончания = ПараметрыДокумента.Дата;
		Иначе
		Отчет.Период.ДатаНачала = НачалоМесяца(ПараметрыДокумента.Дата);			
		Отчет.Период.ДатаОкончания = КонецМесяца(ПараметрыДокумента.Дата);		
		КонецЕсли;
	БезУчётаВыходныхДней = ПараметрыДокумента.БезУчётаВыходныхДней;
		Если БезУчётаВыходныхДней Тогда
		СписокВыходныхДней.Очистить();
		ПолучитьСписокВыходныхДней(ЭтаФорма.Параметры.Документ);		
		КонецЕсли;
	Сформировать(Неопределено);   	
	КонецЕсли; 
КонецПроцедуры
